B35doc/English/online/ewrug_C2/samples/XMLrouting/Harness_VPM_Model.xml

<!--Important: use only API to modify this file !-->

<SOAP_ENV:Envelope xmlns:NS1 = "CATIA/V5/Electrical/1.0" xmlns:NS2 = "http://www.ixfstd.org/std/ns/core/classBehaviors/links/1.0" xmlns:ixf = "http://www.ixfstd.org/std/ns/core/1.0" xmlns:tns = "IXF_Schema.xsd" xmlns:xsi = "http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP_ENV = "http://schemas.xmlsoap.org/soap/envelope/" xsi:schemaLocation = "IXF_Schema.xsd ElectricalSchema.xsd"><SOAP_ENV:Body><ixf:object id = "Electrical Bundle1.1" xsi:type = "tns:Harness"><tns:Name>Electrical Bundle1.1</tns:Name>
</ixf:object>
<ixf:object id = "Signal_minusWire1.1" xsi:type = "tns:Wire"><tns:Name>Signal_minusWire1.1</tns:Name>
<NS1:Wire><NS1:OuterDiameter>0.0094407</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>Signal_minusWire1</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID0" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle1.1"/>
<NS2:object2 href = "#Signal_minusWire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID1" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_M.1Termination_minus"/>
<NS2:object2 href = "#Signal_minusWire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID2" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_M.2Termination_minus"/>
<NS2:object2 href = "#Signal_minusWire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Signal_plusWire1.1" xsi:type = "tns:Wire"><tns:Name>Signal_plusWire1.1</tns:Name>
<NS1:Wire><NS1:OuterDiameter>0.00797885</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>Signal_plusWire1</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID3" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle1.1"/>
<NS2:object2 href = "#Signal_plusWire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID4" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_M.1Termination_plus"/>
<NS2:object2 href = "#Signal_plusWire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID5" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_M.2Termination_plus"/>
<NS2:object2 href = "#Signal_plusWire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Signal_checkWire1.1" xsi:type = "tns:Wire"><tns:Name>Signal_checkWire1.1</tns:Name>
<NS1:Wire><NS1:OuterDiameter>0.0100925</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>Signal_checkWire1</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID6" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle1.1"/>
<NS2:object2 href = "#Signal_checkWire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID7" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_M.1Termination_check"/>
<NS2:object2 href = "#Signal_checkWire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID8" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_M.2Termination_check"/>
<NS2:object2 href = "#Signal_checkWire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_M.1" xsi:type = "tns:Connector"><tns:Name>Connector_M.1</tns:Name>
<NS1:Connector/>
<NS1:Product><NS1:PartNumber>Connector_M</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID9" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_M.1Termination_minus"/>
<NS2:object2 href = "#Connector_M.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_M.1Termination_minus" xsi:type = "tns:Pin"><tns:Name>Termination_minus</tns:Name>
</ixf:object>
<ixf:object id = "UID10" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_M.1Termination_plus"/>
<NS2:object2 href = "#Connector_M.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_M.1Termination_plus" xsi:type = "tns:Pin"><tns:Name>Termination_plus</tns:Name>
</ixf:object>
<ixf:object id = "UID11" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_M.1Termination_check"/>
<NS2:object2 href = "#Connector_M.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_M.1Termination_check" xsi:type = "tns:Pin"><tns:Name>Termination_check</tns:Name>
</ixf:object>
<ixf:object id = "Connector_M.2" xsi:type = "tns:Connector"><tns:Name>Connector_M.2</tns:Name>
<NS1:Connector/>
<NS1:Product><NS1:PartNumber>Connector_M</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID12" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_M.2Termination_minus"/>
<NS2:object2 href = "#Connector_M.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_M.2Termination_minus" xsi:type = "tns:Pin"><tns:Name>Termination_minus</tns:Name>
</ixf:object>
<ixf:object id = "UID13" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_M.2Termination_plus"/>
<NS2:object2 href = "#Connector_M.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_M.2Termination_plus" xsi:type = "tns:Pin"><tns:Name>Termination_plus</tns:Name>
</ixf:object>
<ixf:object id = "UID14" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_M.2Termination_check"/>
<NS2:object2 href = "#Connector_M.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_M.2Termination_check" xsi:type = "tns:Pin"><tns:Name>Termination_check</tns:Name>
</ixf:object>
<ixf:object id = "Battery 6Volts.1" xsi:type = "tns:Equipment"><tns:Name>Battery 6Volts.1</tns:Name>
<NS1:Product><NS1:PartNumber>Battery 6Volts</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID15" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.2"/>
<NS2:object2 href = "#Battery 6Volts.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.2" xsi:type = "tns:Connector"><tns:Name>Connector_F.1</tns:Name>
<NS1:Connector/>
<NS1:Product><NS1:PartNumber>Connector_F</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID16" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.2Termination_minus"/>
<NS2:object2 href = "#Connector_F.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.2Termination_minus" xsi:type = "tns:Pin"><tns:Name>Termination_minus</tns:Name>
</ixf:object>
<ixf:object id = "UID17" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.2Termination_plus"/>
<NS2:object2 href = "#Connector_F.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.2Termination_plus" xsi:type = "tns:Pin"><tns:Name>Termination_plus</tns:Name>
</ixf:object>
<ixf:object id = "UID18" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.2Termination_check"/>
<NS2:object2 href = "#Connector_F.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.2Termination_check" xsi:type = "tns:Pin"><tns:Name>Termination_check</tns:Name>
</ixf:object>
<ixf:object id = "Battery 6Volts.2" xsi:type = "tns:Equipment"><tns:Name>Battery 6Volts.2</tns:Name>
<NS1:Product><NS1:PartNumber>Battery 6Volts</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID19" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.1"/>
<NS2:object2 href = "#Battery 6Volts.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.1" xsi:type = "tns:Connector"><tns:Name>Connector_F.2</tns:Name>
<NS1:Connector/>
<NS1:Product><NS1:PartNumber>Connector_F</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID20" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.1Termination_minus"/>
<NS2:object2 href = "#Connector_F.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.1Termination_minus" xsi:type = "tns:Pin"><tns:Name>Termination_minus</tns:Name>
</ixf:object>
<ixf:object id = "UID21" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.1Termination_plus"/>
<NS2:object2 href = "#Connector_F.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.1Termination_plus" xsi:type = "tns:Pin"><tns:Name>Termination_plus</tns:Name>
</ixf:object>
<ixf:object id = "UID22" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.1Termination_check"/>
<NS2:object2 href = "#Connector_F.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.1Termination_check" xsi:type = "tns:Pin"><tns:Name>Termination_check</tns:Name>
</ixf:object>
<ixf:object id = "WireGroup1.1" xsi:type = "tns:WireGroup"><tns:Name>WireGroup1.1</tns:Name>
<NS1:WireGroup><NS1:Diameter>0.002</NS1:Diameter>
</NS1:WireGroup>
<NS1:Product><NS1:PartNumber>WireGroup1</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "WG1Wire1.1" xsi:type = "tns:Wire"><tns:Name>WG1Wire1.1</tns:Name>
<NS1:Wire><NS1:OuterDiameter>0.002</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>WG1Wire1</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID23" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle1.1"/>
<NS2:object2 href = "#WireGroup1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID24" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_M.1Termination_minus"/>
<NS2:object2 href = "#WG1Wire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID25" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_M.2Termination_minus"/>
<NS2:object2 href = "#WG1Wire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID26" xsi:type = "tns:WireGroupLink"><NS2:link><NS2:object1 href = "#WireGroup1.1"/>
<NS2:object2 href = "#WG1Wire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "WireGroup2.1" xsi:type = "tns:WireGroup"><tns:Name>WireGroup2.1</tns:Name>
<NS1:WireGroup><NS1:Diameter>0.005</NS1:Diameter>
</NS1:WireGroup>
<NS1:Product><NS1:PartNumber>WireGroup2</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "WG2Wire1.1" xsi:type = "tns:Wire"><tns:Name>WG2Wire1.1</tns:Name>
<NS1:Wire><NS1:OuterDiameter>0.005</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>WG2Wire1</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID27" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle1.1"/>
<NS2:object2 href = "#WireGroup2.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID28" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_M.1Termination_minus"/>
<NS2:object2 href = "#WG2Wire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID29" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_M.2Termination_minus"/>
<NS2:object2 href = "#WG2Wire1.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID30" xsi:type = "tns:WireGroupLink"><NS2:link><NS2:object1 href = "#WireGroup2.1"/>
<NS2:object2 href = "#WG2Wire1.1"/>
</NS2:link>
</ixf:object>
</SOAP_ENV:Body>
</SOAP_ENV:Envelope>


